
# while 条件：
#     重复执行一行或者多行代码
# 每次会判断while 关键字后面的条件是否为真，若为真，则执行while 下面的一行或者多行代码，直到不满足条件，循环执行结束；
# 注意：如果条件永远满足，则意味着循环永远会被执行，这叫死循环，是无意义的

##########################################################################################
# 练习：打印1-100的数字
# 循环次数
i = 1
while i<=100:
    print(i)
    i +=1  # 等价于 ：i +1
print('end')
##########################################################################################
# 打印1-100之间的偶数:方式一
# i = 2
# while i<=100:
#     print(i)
#     i +=2 # 等价于 ：i +2
# print('end')

# 打印1-100之间的偶数:方式二
i = 2
while i<=100:

    if i % 2 == 0:
      print(i)
    i +=2 # 等价于 ：i +2
print('end')


