
# 计算1-100所有数的累加和
##########################################################################################
# # 记录数字
# start = 1
# # 保存累加和
# total = 0
# total=total + start  # 0+1=1
# start += 1
#
# total=total + start  # 1+1=2
# start += 1
#
# total=total + start  # 2+1=3
# start += 1
##########################################################################################
# # 记录数字
# i = 1
# # 保存累加和
# total = 0
# total=total + i  # 0+1
# i += 1
#
# total=total + i  # 0+1+2=3
# i += 1
#
# total=total + i  # 0+1+2+3=6
# i += 1

#########################################################################################
# # 计算1-100所有数的累加和
# # 记录数字
# i = 1
# # 保存累加和
# total = 0
# while 1 <= i <= 100:
#     total = total + i
#     i += 1
# print('总和',total)

##########################################################################################
# # 2.计算1-100的奇数和
# --------方法一--------
# 记录数字
i = 1
# 保存累加和
my_sum = 0
while 1 <= i <= 100:
    if i % 2 ==1:  # 也可写 if i % 2!=0:
        # print(i)  # 打印所有奇数列表
        my_sum = my_sum + i
    i += 1
print('总和：',my_sum)

# # --------方法二----------
# 记录数字
i = 1
# 保存累加和
total = 0
while 1 <= i <= 100:
    total = total + i
    # print(i)  # 打印所有奇数列表
    i += 2
print('总和',total)

##########################################################################################
# 3.计算1-100的偶数和
# --------方法一--------
i = 2
total = 0
while 2 <= i <=100:
    if i % 2 ==0:  # 也可写 if i % 2 !=1:
        # print(i)  # 打印所有的偶数列表
        total = total +i
    i += 1
print('偶数和：',total)

# --------方法二--------
#  记录数字
i = 2
# 保存累加和
total = 0
while 1 <= i <= 100:
    total = total + i
    # print(i)  # 打印所有的偶数列表
    i += 2
print('总和',total)
##########################################################################################
# 4.练习：
# 打印 （10个*）
# *
# **
# ***
# ****
# *****
# ******
# *******
# ********
# *********
# **********

# 代码实现：
i = 1
while 1<= i <=50:
    print('*'*i)
    i +=1