# continue
# 注意：1.continue ：跳过本次循环
#   2.当执行到continue，后面的代码不会再执行了直接回到while 后面的条件重新判断，
#   3.continue 只能在循环中使用
##########################################################################################
# 计算1-100所有数的累加和，其中50不加
# ---------方法一--------
# 记录数字
i = 1
# 保存累加和
total = 0
while 1 <= i <= 100:
    if i != 50:
        total = total + i  #也可写：total += i
    i += 1
print('总和',total)

# ----------方法二-------------
# 记录数字
i = 1
# 保存累加和
total = 0
while 1 <= i <= 100:
    if i == 50:
        i += 1
        continue
    total = total + i  #也可写：total += i
    i += 1
print('总和：',total)

