# break
# 注意：1.break 退出循环
#      2.break 执行后，后面的代码不再执行，并且马上终止循环
##########################################################################################
# # 举例：执行1-100，当大于50时，终止循环
# 方法一：
# i= 0
# while i<=100:
#     if i>50:
#         break
#     print(i)
#     i +=1

# 方法二：
i = 0
my_sum = 0
while True:  # true 代表下面两个if 条件的结果
    if i > 100:
        break
    if i == 50:
        i += 1
        continue
    my_sum +=i
    i +=1
    print('my_sum',my_sum)

##########################################################################################
# # while 循环中再次while循环
# i =0
# while i<3:
#     j=0
#     while j<3:
#         if j ==2:
#             break
#         # print(j)
#         j +=1
#     print(i)
#     i +=1
