# 首先会申请一块内存 10
# 变量存储程序中需要的临时数据
a = 10  # 创建一个新的变量并赋值操作，= 是赋值运算符
a = 100  # 重新赋值

##########################################################################################
# 变量名的命名规则：
# 1.	必须由字母+下划线+数字，且数字不能开头
# 2.	标识符区分大小写
# 3.	一般小写加下划线
# 4.	不能和关键字和已有的名字冲突
# 5.	一定要有意义，提升代码的可读性
# 6.	变量名取的有意义
##########################################################################################
# 举例
big_apple = 100

# 变量类型
    # 1.字符串类型(string)
my_str = 'hello world!'

    # 2.数字类型(int\float)
a = 10
b = 3.14

my_b = type(b)
print(my_b)
    # 3.布尔类型

# 赋值运算符，先看右边，再看左边
my_type = type (my_str)
print(my_type)

