# 算数运算符
    # 加
a = 10
b = 20
c =a +b
print(c)

    # 减法

    # 整除:把结果去除小数点
a = 9
b = 2
c = a // b
print(c)

    # 取余数
a = 9
b = 2
c = a % b
print(c)

    # 幂
a = 9
b = 2
c = a ** b
print(c)

##########################################################################################

# 符合赋值运算符 +=
# --
a = 10
a = a + 10  # 等价于a += 10
print(a)

a = 10
a += 10  # 等价于a = a + 10
print(a)

# 类似的其他
# -=

a = 10
a = a - 10  # 等价于a -= 10
print(a)

a = 10
a -= 10  # 等价于a = a - 10
print(a)

# //=
a = 10
a = a // 10  # 等价于a //= 10
print(a)

a = 10
a //= 10  # 等价于a = a // 10
print(a)

# **=
a = 10
a = a ** 10  # 等价于a **= 10
print(a)

a = 10
a **= 10 # 等价于a = a ** 10
print(a)

